actuator/old/actuatorSvarnas/flow_cht/flow_laminar/constant/dielectric/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/dielectric";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    // Kapton

    specie
    {
        molWeight       588.6;
    }
    equationOfState
    {
        rho             1420.0;
    }
    transport
    {
        kappa           0.2;
    }
    thermodynamics
    {
        Hf              0;
        Cp              1.090;
    }
}

// ************************************************************************* //
