actuator/old/actuatorSvarnas/flow_cht/flow_laminar/0/dielectric/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftBoundary
    {
        type            calculated;
        value           $internalField;
    }

    rightBoundary
    {
        type            calculated;
        value           $internalField;
    }

    dielectric_to_insulator
    {
        type            calculated;
        value           $internalField;
    }

    dielectric_to_region0
    {
        type            calculated;
        value           $internalField;
    }

    highVoltage
    {
        type            calculated;
        value           $internalField;
    }

    ground
    {
        type            calculated;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
