actuator/old/actuatorSvarnas/flow_cht/flow_laminar/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{

    upperBoundary
    {
        type            zeroGradient;
    }

    leftBoundary
    {
        type            zeroGradient;
    }

    rightBoundary
    {
        type            zeroGradient;
    }

    region0_to_dielectric
    {
        type            zeroGradient;
    }

    highVoltage
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }

    // ".*"
    // {
    //     type            fixedFluxPressure;
    //     value           $internalField;
    // }
    // fluidOutlet
    // {
    //     type            fixedValue;
    //     value           $internalField;
    // }
}

// ************************************************************************* //
